#include <iostream>

using namespace std;

/*
  С клавиатуры вводится произвольная строка длиной не более 80 символов. Затем вводится ключ - подстрока, длиной не более 10 символов.

  Необходимо:
    1). Определить количество вхождений ключа в строку (с учётом возможного наложения расположения одного ключа на другой).
    2). Вставить перед и после вхождения подстроки символы кавычки " ".
    3). Определить символ наиболее часто встречающийся в строке.
    4). Вывести на экран все слова, содержащиеся в строке (возможные разделители (- , . ! ? ; <пробел>))
*/

int main()
{

}
